createskyblue/esp32s3-imu-gesture-recognition/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_SINGLE_APP=n
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
# CONFIG_FREERTOS_USE_IDLE_HOOK is not set

# ESP32-S3 立创实战派: 16 MB flash + 8 MB octal PSRAM for application buffers.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=n

#
# BLE (NimBLE host) + BluFi 配网
# CONFIG_BLE_ENABLED:BLE 总开关;CONFIG_BLUFI_PROVISIONING_ENABLED:配网(依赖 BLE)
# 关闭两者则整个蓝牙栈都不编译(省 ~40 KB SRAM)
#
# Temporarily disabled (keep code, flip to y to restore; saves ~40KB SRAM)
CONFIG_BLE_ENABLED=n
CONFIG_BLUFI_PROVISIONING_ENABLED=n
CONFIG_BT_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=n
# CONFIG_BT_NIMBLE_BLUFI_ENABLE is not set

#
# LED 模块（立创实战派无板载 LED，默认关闭；代码保留，需要时置 y）
#
CONFIG_LED_TASK_ENABLE=n

#
# LVGL 9.5 (Kconfig 配置方式, CONFIG_LV_CONF_SKIP=y 即不使用 lv_conf.h)
# 参考 ESP32_PAR20_4H_IDF 项目的 sdkconfig
#
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_MEM_SIZE_KILOBYTES=24
CONFIG_LV_DEF_REFR_PERIOD=16

# FreeRTOS 1000 Hz tick: ms-resolution timers + correct vTaskDelay()
CONFIG_FREERTOS_HZ=1000

CONFIG_LV_DPI_DEF=130
CONFIG_LV_OS_NONE=y
CONFIG_LV_USE_DRAW_SW=y
CONFIG_LV_DRAW_SW_SUPPORT_RGB565=y
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=y
CONFIG_LV_USE_FLOAT=y
# LVGL built-in performance monitor: on-screen FPS + CPU (and memory) window.
# Shown automatically by lv_display_create(); replaces any custom FPS logging.
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_PERF_MONITOR_ALIGN_TOP_LEFT=y
# CONFIG_LV_USE_MEM_MONITOR is not set
# CONFIG_LV_MEM_MONITOR_ALIGN_BOTTOM_LEFT is not set

CONFIG_LV_USE_CHART=y
CONFIG_LV_USE_BUTTON=y
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_USE_MATRIX=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y
# 演示/示例与矢量图形不编译, 减小体积与编译时间
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_USE_THORVG=n
# LVGL draw buffers: y=PSRAM (default), n=DRAM (refresh benchmark)
CONFIG_LCD_LVGL_BUF_IN_PSRAM=y

# ESP32-S3 runs up to 240 MHz; template defaulted to 160 MHz which slows LVGL rendering
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

